package com.hm.stock.modules.execptions;

import lombok.Getter;

@Getter
public enum ErrorResultCode implements ResultCode{
    E000001( 500,"数据异常"),
    E000002( "账号或密码错误"),
    E000003( "市场不存在"),
    E000004( "货币只能与主市场进行转换"),
    E000005( "可用资金不足"),
    E000006( "用户不存在"),
    E000007( "用户状态异常"),
    E000008( "实名信息已经存在"),
    E000009( "请上传图片"),
    E000010( "用户已存在"),
    E000011( "已审批通过"),
    E000012( "已修改,请刷新重试"),
    E000013( "已审批拒绝"),
    E000014( "未填写银行卡"),
    E000015( "股票不存在"),
    E000016( "禁止交易"),
    E000017( "购买数量小于最低限制数量"),
    E000018( "购买数量大于最高限制数量"),
    E000019( "周末无法交易"),
    E000020( "节假日无法交易"),
    E000021( "不在交易时间"),
    E000022( "涨停"),
    E000023( "未实名认证"),
    E000024( "股票持仓不存在"),
    E000025( "非法的邀请码"),
    E000026( "手机号已存在"),
    E000027( "已提交实名申请"),

    E000028( "产品不存在"),
    E000029( "申购记录不存在"),
    E000030( "未中签, 无法缴纳"),
    E000031( "已缴纳"),

    E000032( "小于最低申请金额"),
    E000033( "大于最高申请金额"),
    E000034( "额度不足"),
    E000035( "已申请还款"),

    E000036( "已注册"),
    E000037( "验证码不正确"),

    E000038( "产品已下架"),


    E000039( "币不存在"),
    E000040( "开多, 止盈价格必须大于现价"),
    E000041( "开多, 止跌价格必须小于现价"),
    E000042( "开空, 止盈价格必须小于现价"),
    E000043( "开空, 止跌价格必须小于现价"),
    E000044( "提交合约委托失败"),
    E000045( "提交合约失败"),
    E000046( "限价交易请填写限价"),
    E000047( "限价小于现价"),
    E000048( "合约不存在"),
    E000049( "委托不存在"),
    E000050( "合约已平仓"),
    E000051( "委托已结束"),



    E000052( "提现密码不正确"),
    E000053( "无法交易"),
    E000054( "存在未结清的贷款"),

    E000055( "股票持仓时间不足"),

    E000056( "选择的手机区号非法"),

    E000057( "不在提现时间段"),
    E000058( "未达到最低提现金额: {0}"),
    E000059( "提现记录不存在"),
    E000060( "非待审核记录无法取消"),

    E000061( "申购数量要大于: {0}"),

    E000062( "股票已涨停"),

    ;


    private final int code;

    private final String message;

    ErrorResultCode(String message) {
        this.code = 10000;
        this.message = message;
    }
    ErrorResultCode(int code,String message) {
        this.code = code;
        this.message = message;
    }
}
